# Brewfile — Travis's macOS setup
# Usage: brew bundle --file=~/dotfiles/Brewfile

# --- Core tools ---
brew "fzf"              # Fuzzy finder
brew "gh"               # GitHub CLI
brew "mosh"             # Mobile shell (better SSH)
brew "neovim"           # Editor
brew "node"             # Node.js
brew "starship"         # Cross-shell prompt
brew "tmux"             # Terminal multiplexer

# --- Dev tools (uncomment as needed) ---
brew "deno"             # JS/TS runtime
brew "postgresql@16"    # Postgres (for OrgFlow, etc.)
# brew "gnupg"          # GPG encryption
# brew "pandoc"         # Document format conversion
# brew "rclone"         # Cloud storage sync
# brew "sshpass"        # Non-interactive SSH auth
# brew "yt-dlp"         # Video downloader

# --- Casks ---
cask "claude-code"      # Claude Code CLI
cask "flameshot"        # Screenshot tool
cask "font-meslo-lg-nerd-font"  # Nerd font for terminal
cask "font-ubuntu"      # Ubuntu font
cask "ghostty"          # Terminal emulator
cask "rectangle"        # Window tiling (keyboard shortcuts)
# cask "chromedriver"   # Browser automation (uncomment if needed)
